
//#include <stdio.h> //HeadType
//int main() //main함수 - 모든프로그래밍에 메인함수 오롯이 한개 필수(메서드)
//{
//	//함수가 실행되려고 하면, 메인 함수가 호출이 되어야 함 
//	// 함수가 실행되는 이유는 운영체제가 메인 함수를 호출 시켜줬기 때문 
//	// 운영체제가 필요한 메모리를 할당시켜줌 
//
//	//return - 운영체제로 되돌려 준다 : 프로그램 정상적으로 종료 = return 0;
//	return 0;
//}


/* 작성자 : 박효진
	제목 : 10과 20을 더하는 프로그램 
*/

//#include <stdio.h> //헤더파일이며 확장자는 .h - 함수 정의를 지니고 있음

//int main(void)     //메인함수
//{                  // 함수의 시작
//	10 + 20;
//	printf("%d\n", 10 + 20);
//	return 0;      // 함수의 종료
//}                  // 함수의 끝