/*함수 정의*/
// 1. 함수 정의
// 2. 함수 호출
// 3. 함수 원형 
// 
// 1.함수 정의
// 함수는 입력과 출력이 있음 
// 입력 = 선언 형태로 입력을 받는다
// 
// 2. 함수 호출
// 함수 실행하기 위해서는, 호출이 필요함 
// 우리가 만든 함수 : 사용자 함수 
// 사용자 함수는  main이 호출함 
// 출력이 없는 함수머리로 호출함, 입력을 main의 실제 인수를 사용하고, 동일한 타입의 선언 형태
// 호출입장에서는 실제 인수가 저장됨 
// { 선언된 변수 } : local 
//
// 3. 함수 원형 (선언)
// - main함수 위에다 선언 
// - 형태 : 함수머리 ; 
//

//
//void sum()			// 함수 머리
//{					// 함수 몸체
//
//}
//
//void sum(int a, int b)
//{
//	//(int a, int b) : 입력 , 입력은 선언 해준다. 현재 두개 입력 존재
//
//	int a = 5;
//	// int a = 5-실인수 와 void sum(int a)-매게변수 의 5는 다른형태 (원본-복사)개념 
//}